[net]
# Training
batch=96
subdivisions=1

width=416
height=416
channels=3

# learning rates
momentum=0.9
decay=0.0005
learning_rate=0.01
max_batches=500000
burn_in=1000

policy=steps
# steps=819,13101,25384,37666,49948,62231,74513,86795,99078,111360,123642,135925,148207,160489,172772,185054,197336,209619,221901,234183,246466,258748,271030,283313,295595,307877,320160,332442,344724,357007,369289,381571,393854,406136,418419,430701,442983,455266,467548,479830,492113
# scales=1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,6.0,1.5,1.25,0.75,0.5,0.25,6.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25
steps=1025,16404,31782,47160,62538,77917,93295,108673,124051,139430,154808,170186,185565,200943,216321,231699,247078,262456,277834,293213,308591,323969,339347,354726,370104,385482,400861,416239,431617,446995,462374,477752,493130
scales=1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,6.0,1.5,1.25,0.75,0.5,0.25,6.0,1.5,1.25,0.75
# sgdr_cycle=1000
# sgdr_mult=2
# don't enable it on a headless machine
#adversarial_lr=1.0

# augmentations
angle=15
hue=.1
saturation=.75
exposure=.75
aspect=.75
mosaic=1
mosaic_bound=1
gaussian_noise=1
letter_box=1
#attention=1

[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=1

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

###########

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=78
activation=linear

[yolo]
mask = 3,4,5
#anchors = 10,14,  23,27,  37,58,  81,82,  135,169,  344,319
#anchors recalculated
anchors = 11,19, 19,33, 32,52, 77,80, 152,122, 261,262
classes=21
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1

[route]
layers = -4

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 8

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=78
activation=linear

[yolo]
mask = 0,1,2
#anchors = 10,14,  23,27,  37,58,  81,82,  135,169,  344,319
#anchors recalculated
anchors = 11,19, 19,33, 32,52, 77,80, 152,122, 261,262

classes=21
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1
