[net]
# Training
batch=64
subdivisions=2

width=416
height=416
channels=3

# learning rates
momentum=0.9
decay=0.0005
learning_rate=0.01
max_batches=100000
burn_in=1000

policy=steps
steps=92,1015,1937,2859,3782,4704,5626,6549,7471,8393,9316,10238,11160,12083,13005,13927,14850,15772,16694,17617,18539,19461,20384,21306,22228,23151,24073,24996,25918,26840,27763,28685,29607,30530,31452,32374,33297,34219,35141,36064,36986,37908,38831,39753,40675,41598,42520,43442,44365,45287,46209,47132,48054,48976,49899,50821,51743,52666,53588,54511,55433,56355,57278,58200,59122,60045,60967,61889,62812,63734,64656,65579,66501,67423,68346,69268,70190,71113,72035,72957,73880,74802,75724,76647,77569,78491,79414,80336,81258,82181,83103,84026,84948,85870,86793,87715,88637,89560,90482,91404,92327,93249,94171,95094,96016,96938,97861,98783,99705
scales=1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5,1.25,0.75,0.5,0.25,3.0,1.5
# policy=sgdr
# sgdr_cycle=1000
# sgdr_mult=2
# don't enable it on a headless machine
#adversarial_lr=1.0

# augmentations
angle=15
hue=.1
saturation=.75
exposure=.75
aspect=.75
mosaic=1
mosaic_bound=1
gaussian_noise=1
letter_box=1
#attention=1

[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=1

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

###########

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=75
activation=linear

[yolo]
mask = 3,4,5
#anchors = 10,14,  23,27,  37,58,  81,82,  135,169,  344,319
#anchors recalculated
anchors = 11,19, 19,33, 32,52, 77,80, 152,122, 261,262
classes=20
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1

[route]
layers = -4

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 8

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=75
activation=linear

[yolo]
mask = 0,1,2
#anchors = 10,14,  23,27,  37,58,  81,82,  135,169,  344,319
#anchors recalculated
anchors = 11,19, 19,33, 32,52, 77,80, 152,122, 261,262

classes=20
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1
